const titles = [
    "M̵͉̬̟̹͈̿̇̔̊͠ͅy̴̦͐̉͠ ̴̧̦̯̳̝͌̐͋͘͝p̶͙̩̖͑̓̈́͐̈́̂ļ̵͔͇̼̣̭͉̀̋͂̒͊ḁ̵͙̟̀y̶̧̛̟͓͎̤͕͚̅̈́ͅͅl̸̛̹̀̅̓͊̀̄̍̕i̸͇̖͂s̵̢̢̭͔͇͍̝͙͂̀̽̽̎̕͝t̴̯͍̦̀̄͐̈́̋̀͂͆͝",
    "M̶̙̹͗̅̂͛y̶̡̛̠̟̻͌̎̊̈́͐̊͂̂͊̀̃̎ͅ ̷̡̧̻̠̥̼̪̹̘̪̱͇̹̩̼̠̜̯̮͊̀̈̍̔̀̾̇̈́̂p̸̛̜̳̥̫̠̞͈̦͋̓̅l̸̛͉̼͇̼͒̑͋̓͑̒͑̈́͠ä̶̧̠͚̮͍͓̻̝̜͚̝̭̣͚́̄̿̂̑̄̾͛̇́̑͐̾̋̽͘͝ͅỵ̵̡̙̲͍̣̄̀͆̂̄̓̓ļ̶̞̮̗͎̝̘͓̮͇̥̹̭̥̞͙̇̎̆͑̚͜͝ḯ̴̤̣͕͖̺̝̭̲̈̋̏̄͌́͘š̸̛̩̖̫̙̟̼͚̆̔͑̌̃͊̃̄̒̃͆͌̚͘͝t̷̢̛͎̹̺̹̝̰̰̱̖͙̗͓̮͈̳̰̝͐̄̊̈̂̈́͘͜͝͝͝",
    "M̵̨̢̯͍̞̥̱͍̮͙̟͇̰̝̝͑̇́̓̽̍̍̈́̐̔̐̔̃͐̍̈́͘͝͠͠y̴̢̢͈̪̫̖̗͕̣̠̰͙̘̼̦̹̞͖̥͒̀̆́̀̊̒̾̓̓̀͝͝ͅͅ ̵̨̨̛̪̗̬͚̞̖̙͎̼͍̞͕̞̞̙̪͚̲̉͛͊̒̈́͋́͂́̊̆͊̎̏̒̐̍̔̿̑̕͝ͅͅp̸̢̨̢̨̨̢̧͚͕̹͓̙̟̰͖̞̥͙͙̪̙̘͙͈̭̳̝̜̟̅̈́͛̾l̷̗̻͓͈̪̩̝͕̹̻͇̜̭̟͕͍̤̠̠̮͎̋͌̐̃͊͌̊̔͆̈́̉͛̊̒̚͜͜͠͝a̵̢̧̪̰̬͖̙̘̜̠̥̲͓͓̣̣̟͙̩̤̝̬͇̱̫͔̺̥̤̐͌̉̎̋̔͆̇̍̌̍̓̓͗͜͠͝y̵̡̢̨̡̗͚̳͓̙̜̫̳͔̗̲̞̞̞̱͕̬͔̼̩͔̖͓̞̍͊͑͗̉̈͊͆͘͜ͅl̶̢̡̻͖͎̯̣͈͔̭̩̭̤̼̣̥̣̙͈̥̯̪̎̋̏̿̆̂̀̇̓̅́̎̂̋̐͑͊̆̐͋̔̍̚̕͝͝͝i̸̛̘͉̥̳͉̱̇̏̾͆̂̅̀͛͆̈́͂̉̀͂̒̈́̐̽̀̍͂̓͌͗̚͘̚͝͠s̴̨̧̧̨̪̦̰̻̱̳̤̪̠͈̘͓̺̯̤͈̩̫͇̱̮̣̬͛͑̌̈́̀͂͗̔̀̊̊͛̍̄͆̚t̵̛̬͒̆̈́͗̄̀͑͛͊̀̄̀͑̆̿̀̊̿̾̓̾̌̕͘",
    "M̶̹͚̱͔͌͊̾̂͑͛͝y̵̛̦̱͚̬̽̀̾̀̈́̌̊̈̃̒̈́̈́̄͌̓̆̓͂̃͋̓͆̍̑̓̄͒̔̆̐͐̅̀̇̈́̈̾̎̚̚̚͘͝ ̴̨̡̧̛̣̥̺̻̘̳͈̺̣̩̦̰̗͕͓̘̙͚͉͎̜̱̦͓̻̥̟͔̜̹̖̪͍̒͗̑̕ͅp̸̨̛͍͍͙̣̱̝̱̰̦͉̯̪̹͉͎̞̙̦̠̖̜̝͚̥̣̺͈̟͖̹̪̪̞̰̲̖̐̓͆̐̌̑̃͗̑̂̓̅̒͑̉͆͑̎͗̑̒̈͌̇̓̅̐̈́̓ͅl̴̨̢̧̢̢̢̛͔͙̳͕̜͙͓̺͚̩͍̦̘̺͙̤̘͉̼̮̪͖̯̰̘̥̪̘̈́̅̈́͜ͅͅá̴̧̧̻̳̠̻̯̫̼̖̬̩͇͙̮̥̭̜͖̞̙̫͙͍̺̯͖̙͉̯̺͕̉̍͆͒̊͂̅̊̎̂͌̉̀͆̑́̏̋̎̆̄̒̿̓̋̈́̒̑̈̃͗̚͘͜͠ỳ̸̛̬͖͉͕̼͖̮͔̼͍̺͙̠̻͙̬̻͈̳̘͚̯̹̤̻̣̻̼̬̳̝̜͍̫͇̦̰̝͍̮̦͔̲̔͒̓̊̽͋̉͜͝ͅļ̵̧̛̺̺̯̮̥̰͍͓̱̯̠̯̠̜̘̟̄̐̋̅̐̀̿̍̑̉̌̈́̀̆͋̍̒̅͆̽̀̀̂̓̊̈́́̅̋̽̍͂̕͘͝͝ͅḯ̶̡͈̹̫̱͓͇͔̠̲͍̊̐͌̆̅̏͐̅̿̐̔̀̃̉̅̈́̓͆͛͛́̔͛̊̈́͐̊̊̅̉̇̆͋̑̊̕̚͘̚͠͝͝͝͝͝s̷̡̡̲͓͔̖̭̙̗͈̰̦̦̠͖̦̫̹̻̯͕̱̻͕̘̈́̔̾͌̒̓̇̌̅̍͗̃̉̅͛͛̈́̅̐̾̒͒̈͐̌̓̈̿̂̄͌̀͊͆͋͑͛͒͊͛̚͠͝͝͠͠ț̵̢̧̢̢̧̯̼̙̱̟͙̫̞̥͔̳͖̥̗̺͔͍̹̻̭͕͕͉̖̜̦̗͈̫́͌"
];
let index = 0;
const intervalTime = 1;
function rotateTitle() {
    if (index === titles.length) {
        index = 0;
    }
    document.title = titles[index];
    index++;
}
rotateTitle();
window.setInterval(rotateTitle, intervalTime);